In [46]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [22]:
df=pd.read_csv("Downloads/messy_zomato_data.csv")

In [23]:
df.head()

,name,online_order,book_table,rate,votes,approx_cost(for two people),listed_in(type)
0,aalsa,Yes,Yqs,NaN,775.0,800.0,Buffet
1,Spice Elephant,Yes,NaN,NaN,NaN,800.0,Buffet
2,San Churro Cafe,Yed,No,3.8/5,918.0,800.0,Buffet
3,Addhuri Udupi Bhojana,No,No,3.7/5,88.0,300.0,Buffet
4,Grand Village,No,No,NaN,166.0,600.0,Buffet

In [24]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 155 entries, 0 to 154
Data columns (total 7 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   name                         138 non-null    object
 1   online_order                 138 non-null    object
 2   book_table                   140 non-null    object
 3   rate                         131 non-null    object
 4   votes                        140 non-null    float64
 5   approx_cost(for two people)  140 non-null    float64
 6   listed_in(type)              140 non-null    object
dtypes: float64(2), object(5)
memory usage: 8.6+ KB

In [25]:
df.describe()

             votes  approx_cost(for two people)
count   140.000000                   140.000000
mean    300.814286                   899.642857
std     703.890173                  2333.910915
min       0.000000                   100.000000
25%       4.000000                   250.000000
50%      40.500000                   400.000000
75%     244.250000                   600.000000
max    4884.000000                 18000.000000

In [26]:
print(df['online_order'].unique())

['Yes' 'Yed' 'No' nan 'Yys' 'qes' 'ies' 'xes' 'bes' 'Yts']

In [27]:
mapping={"yes":'yes','yed':'yes','No':'no','Yys':'yes','qes':'yes','ies':'yes','xes':'yes','bes':'yes','yts':'yes','no':'no'}

In [28]:
df["online_order"].unique()

array(['Yes', 'Yed', 'No', nan, 'Yys', 'qes', 'ies', 'xes', 'bes', 'Yts'],
      dtype=object)

In [35]:
df["online_order"]=df["online_order"].map(mapping)

In [36]:
df.isnull().sum()

name                            17
online_order                   155
book_table                      15
rate                            24
votes                           15
approx_cost(for two people)     15
listed_in(type)                 15
dtype: int64

In [38]:
from sklearn.preprocessing import LabelEncoder
le=LabelEncoder()
df["online_order"]=le.fit_transform(df["online_order"])

In [40]:
df.head()

,name,online_order,book_table,rate,votes,approx_cost(for two people),listed_in(type)
0,aalsa,0,Yqs,NaN,775.0,800.0,Buffet
1,Spice Elephant,0,NaN,NaN,NaN,800.0,Buffet
2,San Churro Cafe,0,No,3.8/5,918.0,800.0,Buffet
3,Addhuri Udupi Bhojana,0,No,3.7/5,88.0,300.0,Buffet
4,Grand Village,0,No,NaN,166.0,600.0,Buffet

In [43]:
df.tail()

,name,online_order,book_table,rate,votes,approx_cost(for two people),listed_in(type)
150,Smacznego,0,No,NaN,504.0,550.0,Cafls
151,NaN,0,No,2.9/5,0.0,250.0,Dining
152,Cafe Coffee Day,0,No,3.6/5,28.0,18000.0,Cafes
153,Addhuri Udupi Bhojana,0,No,3.7/5,88.0,300.0,Buffev
154,Penthouse Cafe,0,No,NaN,324.0,700.0,othwr

In [42]:
df["online_order"].unique()

array([0])

In [49]:
df["book_table"].unique()

array(['Yqs', nan, 'No', 'Yes', 'Yeu'], dtype=object)

In [50]:
mapp={'yqs':'yes','No':'no','yes':'yes','yeu':'yes'}

In [52]:
df["book_table"]=df["book_table"].map(mapp)

In [72]:
df.isnull().sum()

name                           17
online_order                    0
book_table                      0
rate                            0
votes                           0
approx_cost(for two people)    15
listed_in(type)                15
dtype: int64

In [59]:
df['rate'] = pd.to_numeric(df['rate'], errors='coerce')

In [71]:
df["book_table"] = df["book_table"].fillna(df["book_table"].mode()[0])
df["rate"] = df["rate"].fillna(df["rate"].mode()[0])
df['votes']=df['votes'].fillna(df['votes'].mode()[0])

In [66]:
df["votes"].unique()

array([7.750e+02,       nan, 9.180e+02, 8.800e+01, 1.660e+02, 2.860e+02,
       8.000e+00, 2.556e+03, 3.240e+02, 5.040e+02, 1.500e+02, 1.640e+02,
       9.000e+01, 1.440e+02, 9.300e+01, 1.300e+01, 6.200e+01, 1.800e+02,
       7.840e+02, 3.100e+01, 3.080e+02, 4.000e+00, 2.300e+01, 1.480e+02,
       2.190e+02, 5.060e+02, 9.800e+02, 1.720e+02, 4.150e+02, 2.300e+02,
       9.100e+01, 1.647e+03, 4.884e+03, 1.700e+01, 1.330e+02, 2.800e+01,
       5.400e+02, 1.008e+03, 2.440e+02, 8.040e+02, 2.450e+02, 2.100e+01,
       3.450e+02, 6.180e+02, 6.270e+02, 1.040e+02, 3.540e+02, 5.500e+01,
       1.630e+02, 5.800e+01, 8.080e+02, 2.184e+03, 1.720e+03, 3.400e+01,
       3.900e+01, 1.988e+03, 6.000e+00, 5.200e+02, 0.000e+00, 8.400e+01,
       5.580e+02, 2.200e+01, 1.530e+02, 1.460e+02, 4.200e+01, 6.600e+01,
       4.401e+03, 7.000e+00, 9.000e+00, 2.830e+02, 6.500e+01, 7.100e+01,
       5.200e+01, 1.000e+01, 4.500e+01, 1.100e+01, 2.900e+01, 3.000e+01,
       2.010e+02, 2.500e+01, 7.710e+02])

In [70]:
df["votes"]=pd.to_numeric(df["votes"],errors="coerce")

In [73]:
df["listed_in(type)"].unique()

array(['Buffet', nan, 'Cafes', 'other', 'Dining', 'cther', 'bther',
       'Dininv', 'othet', 'Dinijg', 'Diying', 'Dkning', 'Diuing',
       'Dmning', 'Diniug', 'Dhning', 'Diving', 'hining', 'Diging',
       'Dinnng', 'Dinpng', 'Dinxng', 'Cafls', 'Buffev', 'othwr'],
      dtype=object)

In [74]:
min={'buffet':'buffet','cafes':'cafes','other':'other','dining':'dining','cther':'other','bther':'other','dininv':'dining','othet':'other','dinijg':'dining','diying':'dining','dkning':'dining','diuing':'dining','dmning':'dining','diniug':'dining','dhning':'dining','diving':'dining','hining':'dining','diging':'dining','dinnng':'dining','dinpng':'dining','dinxng':'dining','cafls':'cafes','buffev':'buffet','othwr':'other'}

In [83]:
df["listed-in(type)"]=df["listed_in(type)"].map(min)
df["listed_in(type)"]= pd.to_numeric(df["listed_in(type)"], errors='coerce')

In [86]:
mode_value = df["listed_in(type)"].mode()

if not mode_value.empty:
    # If mode exists, fill NaN with mode
    df["listed_in(type)"] = df["listed_in(type)"].fillna(mode_value.iloc[0])
else:
    # If mode is empty, fill NaN with a default value
    df["listed_in(type)"] = df["listed_in(type)"].fillna("Unknown")

In [87]:
df.isnull().sum()

name                            17
online_order                     0
book_table                       0
rate                             0
votes                            0
approx_cost(for two people)     15
listed_in(type)                  0
listed-in(type)                145
dtype: int64